In [6]:
import sqlite3
db = sqlite3.connect('Employee.sqlite')
cur = db.cursor()
query = 'create table EmployeeDetail(employee_id int Primary Key,name text,age int,department text,salary int)'
cur.execute(query)

In [8]:
query = 'insert into EmployeeDetail values(100,"Rishav",25,"Marketing",50000),(101,"Abhishek",26,"Operations",60000),(102,"Aman",24,"Human Resource",75000)'
cur.execute(query)

In [9]:
db.commit()

In [12]:
query = 'delete from EmployeeDetail where employee_id = 101'
cur.execute(query)
db.commit()

In [15]:
employee_id = 100
cur.execute('delete from EmployeeDetail where employee_id = ?',(employee_id,))
db.commit()

In [16]:
employee_id=[101,102,103,104,105,106,107,108,109,110,111,112,113]
name=['Aadarsh','Aarti','Siddharth','Aman','Amit','Shivansh','Vaibhav','Himanshu','Raman','Kunal','Adhira','Tanya']
age=[25,27,25,24,30,26,23,26,25,26,29,24]
department=['Marketing','Operations','Finance','Human Resource','Marketing','IT','Finance','IT','Operations','Marketing','Human Resource','Marketing']
salary=[50000,60000,85000,75000,50000,90000,85000,90000,60000,50000,75000,50000]

values = []

for i in range(len(age)):
    tuple_values = (employee_id[i],name[i],age[i],department[i],salary[i])
    values.append(tuple_values)

cur.executemany('insert into EmployeeDetail values (?,?,?,?,?)',values)
db.commit()

In [19]:
cur.execute('select employee_id from EmployeeDetail where department="Finance"')
employee_ids = cur.fetchall()
for employee_id in employee_ids:
    print(*employee_id)

103
107

In [21]:
cur.execute('select department,count(*) from EmployeeDetail group by department')
department_counts = cur.fetchall()
for dept_count in department_counts:
    print(*dept_count)

Finance 2
Human Resource 2
IT 2
Marketing 4
Operations 2

In [22]:
import pandas as pd
data_frame = pd.read_sql_query("select * from EmployeeDetail", db)
print(data_frame)

    employee_id       name  age      department  salary
0           101    Aadarsh   25       Marketing   50000
1           102      Aarti   27      Operations   60000
2           103  Siddharth   25         Finance   85000
3           104       Aman   24  Human Resource   75000
4           105       Amit   30       Marketing   50000
5           106   Shivansh   26              IT   90000
6           107    Vaibhav   23         Finance   85000
7           108   Himanshu   26              IT   90000
8           109      Raman   25      Operations   60000
9           110      Kunal   26       Marketing   50000
10          111     Adhira   29  Human Resource   75000
11          112      Tanya   24       Marketing   50000

In [23]:
data_frame[data_frame["age"]==30]

   employee_id  name  age department  salary
4          105  Amit   30  Marketing   50000